Repository: AhmedSheri123/softmsg-deployer
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, he

source: SOFTmsg is a marketplace that lets you launch ready-to-use web projects instantly — no coding required, just one click to deploy and manage your apps.
de: SOFTmsg ist ein Marktplatz, auf dem Sie gebrauchsfertige Webprojekte sofort starten können – keine Programmierkenntnisse erforderlich, nur ein Klick zum Bereitstellen und Verwalten Ihrer Apps.

source: Get started for free
de: Kostenlos starten
he: התחל בחינם

source: Marketplace
de: Marktplatz

source: Trusted by industry leaders
de: Vertrauenswürdig bei Branchenführern
he: מהימנים על ידי מנהיגי התעשייה

source: Project Installation Stages
de: Projektinstallationsphasen

source: Discover Project
de: Projekt entdecken

source: Manage Operations
de: Operationen verwalten

source: Subscriptions
de: Abonnements

source: Performance Monitoring
de: Leistungsüberwachung

source: Powerful solutions that <span class='text-success'>launch your projects instantly</span>
de: Leistungsstarke Lösungen, die Ihre Projekte <span class='text-success'>sofort starten</span>

source: One-Click Install
de: Ein-Klick-Installation

source: Open-Source Marketplace
de: Open-Source Marktplatz

source: Easy Management
de: Einfache Verwaltung

source: Secure by Default
de: Standardmäßig sicher

source: Optimized for Servers
de: Server-optimiert

source: Import & Export Projects
de: Projekte importieren & exportieren

source: Team Collaboration
de: Teamzusammenarbeit

source: 24/7 Support
de: Rund-um-die-Uhr-Support

source: Continuous Updates
de: Kontinuierliche Updates

source: Services Features
de: Serviceleistungen
he: תכונות שירותים

source: User-friendly dashboard
de: Benutzerfreundliches Dashboard
he: לוח מחוונים ידידותי למשתמש

source: A simple and intuitive interface that allows you to manage all your operations easily, even for non-technical users.
de: Eine einfache und intuitive Oberfläche, mit der Sie alle Ihre Vorgänge auch für nicht-technische Benutzer problemlos verwalten können.
he: ממשק פשוט ואינטואיטיבי המאפשר לך לנהל את כל הפעולות שלך בקלות, אפילו למשתמשים לא טכניים.

source: Security
de: Sicherheit
he: בִּטָחוֹן

source: Protected from security vulnerabilities
de: Vor Sicherheitslücken geschützt
he: מוגן מפני פגיעויות אבטחה

source: A system equipped with advanced protection technologies to safeguard your data from threats and cyber-attacks.
de: Ein System, das mit fortschrittlichen Schutztechnologien ausgestattet ist, um Ihre Daten vor Bedrohungen und Cyber-Angriffen zu schützen.
he: מערכת המצוידת בטכנולוגיות הגנה מתקדמות כדי להגן על הנתונים שלך מפני איומים ומתקפות סייבר.

source: Customize
de: Anpassen
he: התאמה אישית

source: Customizable
de: Anpassbar
he: ניתן להתאמה אישית

source: A flexible design that allows you to modify the system to suit your specific business needs.
de: Ein flexibles Design, mit dem Sie das System so ändern können, dass sie Ihren spezifischen Geschäftsanforderungen entsprechen.
he: עיצוב גמיש המאפשר לך לשנות את המערכת כך שיתאים לצרכים העסקיים הספציפיים שלך.

source: Responsive
de: Reaktionsschnell
he: מגיב

source: Multi-device support
de: Support mit mehreren Geräten
he: תמיכה מרובת מכשירים

source: Access the system across different devices such as computers, smartphones, or tablets.
de: Greifen Sie auf das System über verschiedene Geräte wie Computer, Smartphones oder Tablets zu.
he: גש למערכת במכשירים שונים כמו מחשבים, סמארטפונים או טאבלטים.

source: Permissions
de: Berechtigungen
he: הרשאות

source: User management and permissions
de: Benutzerverwaltung und Berechtigungen
he: ניהול משתמשים והרשאות

source: An advanced control system that allows you to assign different roles and permissions to users within the system.
de: Ein erweitertes Steuerungssystem, mit dem Sie Benutzern im System unterschiedliche Rollen und Berechtigungen zuweisen können.
he: מערכת בקרה מתקדמת המאפשרת לך להקצות תפקידים והרשאות שונות למשתמשים במערכת.

source: Support
de: Unterstützung
he: תְמִיכָה

source: 24/7 technical support
de: 24/7 technischer Support
he: תמיכה טכנית 24/7

source: A dedicated support team available around the clock to assist you with any issues or inquiries.
de: Ein engagiertes Support -Team, das rund um die Uhr verfügbar ist, um Sie bei Problemen oder Anfragen zu unterstützen.
he: צוות תמיכה ייעודי זמין מסביב לשעון כדי לסייע לך בכל נושא או בירורים.

source: Everything you need to launch and manage your apps — instantly
de: Alles, was Sie brauchen, um Ihre Apps sofort zu starten und zu verwalten

source: SOFTmsg is your marketplace for ready-to-use web projects. Install, monitor, and scale apps in seconds — no coding required.
de: SOFTmsg ist Ihr Marktplatz für sofort einsatzbereite Webprojekte. Installieren, überwachen und skalieren Sie Apps in Sekunden — ganz ohne Programmierung.

source: Instant Deployment
de: Sofortige Bereitstellung

source: Launch projects with <span class="fw-bold">one-click setup and zero downtime</span>
de: Starten Sie Projekte mit <span class="fw-bold">Ein-Klick-Installation und ohne Ausfallzeit</span>

source: One-click deployment with Docker & Traefik
de: Bereitstellung mit einem Klick über Docker & Traefik

source: Automatic SSL & domain management
de: Automatische SSL- & Domainverwaltung

source: Optimized for high traffic and reliability
de: Optimiert für hohen Traffic und maximale Zuverlässigkeit

source: Unified Dashboard
de: Zentrales Dashboard

source: Manage all your apps from <span class="fw-bold">one clean and intuitive interface</span>
de: Verwalten Sie alle Ihre Apps über <span class="fw-bold">eine klare und intuitive Oberfläche</span>

source: Simple UI for beginners and experts
de: Einfache Benutzeroberfläche für Anfänger und Profis

source: Fully responsive and multilingual (i18n)
de: Vollständig responsiv und mehrsprachig (i18n)

source: Clear container and service management
de: Übersichtliches Container- und Service-Management

source: Smart Experience
de: Intelligente Benutzererfahrung

source: SOFTmsg helps you <span class="fw-bold">discover, install, and trust projects</span> with built-in transparency and insights.
de: SOFTmsg hilft Ihnen, <span class="fw-bold">Projekte zu entdecken, zu installieren und ihnen zu vertrauen</span> – mit integrierter Transparenz und Einblicken.

source: Live stats: installs, downloads, and active users
de: Live-Statistiken: Installationen, Downloads und aktive Nutzer

source: Built-in reviews and star ratings
de: Integrierte Bewertungen und Sternebewertungen

source: Access to source code for open-source projects
de: Zugang zum Quellcode von Open-Source-Projekten

source: Auto-sorted containers for smooth deployment flow
de: Automatisch sortierte Container für einen reibungslosen Bereitstellungsablauf

source: SEO-friendly project pages with metadata
de: SEO-freundliche Projektseiten mit Metadaten

source: Key features to <span class='text-success'>manage your projects effortlessly</span>
de: Hauptfunktionen, um Ihre Projekte <span class='text-success'>mühelos zu verwalten</span>

source: Install projects with a single click
de: Projekte mit nur einem Klick installieren

source: One-Click Deployment
de: Bereitstellung mit einem Klick

source: Control project running state easily
de: Projektstatus einfach steuern

source: Create and manage backups safely
de: Backups sicher erstellen und verwalten

source: Restore your projects from backups
de: Projekte aus Backups wiederherstellen

source: Upgrade, renew, or manage subscriptions easily
de: Abonnements einfach aktualisieren, erneuern oder verwalten

source: Monitor usage and performance in real-time
de: Nutzung und Leistung in Echtzeit überwachen

source: Performance
de: Leistung

source: Change the project domain easily
de: Projekt-Domain einfach ändern

source: SSL certificates ready for your project
de: SSL-Zertifikate für Ihr Projekt bereit

source: SSL Certificates
de: SSL-Zertifikate

source: View project logs and activities
de: Projektprotokolle und Aktivitäten anzeigen

source: Logs Viewer
de: Protokollanzeige

source: Rebuild or update your project easily
de: Projekt einfach neu erstellen oder aktualisieren

source: Rebuild & Update
de: Neu erstellen & Aktualisieren

source: Customer reviews
de: Kundenbewertungen
he: ביקורות לקוחות

source: An all-in-one management solution that has significantly improved our workflow. It's fast, accurate, and incredibly efficient.
de: Eine All-in-One-Management-Lösung, die unseren Workflow erheblich verbessert hat. Es ist schnell, genau und unglaublich effizient.
he: פיתרון ניהול של כל אחד ששיפר משמעותית את זרימת העבודה שלנו. זה מהיר, מדויק ויעיל להפליא.

source: Romania
de: Rumänien
he: רומניה

source: A game-changer for our business! The software's versatility and ease of use have enhanced our productivity like never before.
de: Ein Spielveränderer für unser Geschäft! Die Vielseitigkeit der Software und die Benutzerfreundlichkeit haben unsere Produktivität wie nie zuvor verbessert.
he: מחליף משחק לעסק שלנו! הרבגוניות של התוכנה וקלות השימוש של התוכנה שיפרו את הפרודוקטיביות שלנו כמו שלא היה מעולם.

source: German
de: Deutsch
he: גֶרמָנִיָת

source: We’ve tried several management solutions before, but this one stands out for its efficiency and ease of use.
de: Wir haben schon mehrere Managementlösungen ausprobiert, aber dieser sticht auf die Effizienz und Benutzerfreundlichkeit ab.
he: ניסינו כמה פתרונות ניהול בעבר, אך זה בולט ביעילותו וקלות השימוש שלו.

source: Our Team
de: Unser Team
he: הצוות שלנו

source: A highly skilled and trusted Backend Developer with deep expertise in building secure, integrated systems tailored to your business needs. Specializing in designing robust infrastructures and developing custom solutions that ensure efficiency, high performance, and data security. Your ideal partner for creating a flexible and sustainable system that meets your goals with confidence.
de: Ein hochqualifizierter und vertrauenswürdiger Backend -Entwickler mit tiefem Fachwissen zum Aufbau sicherer, integrierter Systeme, die auf Ihre Geschäftsanforderungen zugeschnitten sind. Spezialisiert auf die Gestaltung robuster Infrastrukturen und Entwicklung kundenspezifischer Lösungen, die Effizienz, hohe Leistung und Datensicherheit gewährleisten. Ihr idealer Partner für die Schaffung eines flexiblen und nachhaltigen Systems, das Ihre Ziele mit Zuversicht entspricht.
he: מפתח Backend מיומן מאוד ואמין עם מומחיות עמוקה בבניית מערכות משולבות משולבות המותאמות לצרכים העסקיים שלך. המתמחה בעיצוב תשתיות חזקות ופיתוח פתרונות מותאמים אישית המבטיחים יעילות, ביצועים גבוהים ואבטחת מידע. השותף האידיאלי שלך ליצירת מערכת גמישה ובת קיימא העומדת ביעדים שלך בביטחון.

source: A highly skilled UI/UX Designer with expertise in creating innovative user interfaces and seamless user experiences. Focused on achieving a balance between functional aesthetics and ease of use, ensuring an engaging and effective interactive experience for users. Always striving to transform ideas into exceptional designs that contribute to the success of the project and deliver an unparalleled user experience.
de: Ein hochqualifizierter UI/UX -Designer mit Fachwissen bei der Erstellung innovativer Benutzeroberflächen und nahtloser Benutzererlebnisse. Konzentriert sich auf das Erreichen eines Gleichgewichts zwischen funktionaler Ästhetik und Benutzerfreundlichkeit, um ein ansprechendes und effektives interaktives Erlebnis für Benutzer zu gewährleisten. Ich bemühe mich immer, Ideen in außergewöhnliche Designs zu verwandeln, die zum Erfolg des Projekts beitragen und eine beispiellose Benutzererfahrung liefern.
he: מעצב ממשק משתמש/UX מיומן מאוד עם מומחיות ביצירת ממשקי משתמש חדשניים וחוויות משתמש חלקות. התמקד בהשגת איזון בין אסתטיקה פונקציונלית לקלות שימוש, תוך הבטחת חוויה אינטראקטיבית מרתקת ויעילה למשתמשים. תמיד שואפים להפוך רעיונות לעיצובים יוצאי דופן התורמים להצלחת הפרויקט ומספקים חווית משתמש ללא תחרות.

source: An exceptional Frontend Developer with expertise in transforming designs into interactive, user-friendly websites and applications. Focused on writing clean and efficient code, ensuring a seamless user experience across all devices and browsers. A trusted partner in bringing your vision to life with stunning and fully integrated digital interfaces.
de: Ein außergewöhnlicher Frontend-Entwickler mit Fachwissen bei der Umwandlung von Designs in interaktive, benutzerfreundliche Websites und Anwendungen. Konzentrieren Sie sich auf das Schreiben von sauberem und effizientem Code, um ein nahtloses Benutzererlebnis auf allen Geräten und Browsern zu gewährleisten. Ein vertrauenswürdiger Partner, um Ihre Vision mit atemberaubenden und vollständig integrierten digitalen Schnittstellen zum Leben zu erwecken.
he: מפתח חזית יוצא דופן עם מומחיות בהפיכת עיצובים לאתרים ויישומים אינטראקטיביים וידידותיים למשתמש. התמקד בכתיבת קוד נקי ויעיל, ומבטיח חווית משתמש חלקה בכל המכשירים והדפדפנים. שותף מהימן בהעלאת החזון שלך לחיים עם ממשקים דיגיטליים מדהימים ומשולבים לחלוטין.

source: A professional female Project Manager with extensive experience in successfully planning and executing projects. She is responsible for coordinating between different teams, setting objectives and tasks, and managing resources to ensure project delivery on time and within budget. She possesses strong leadership skills and problem-solving abilities, making her a key partner in achieving project success and guiding it toward desired outcomes.
de: Eine professionelle Projektmanagerin mit umfassender Erfahrung in der erfolgreichen Planung und Ausführung von Projekten. Sie ist verantwortlich für die Koordinierung zwischen verschiedenen Teams, für die Festlegung von Zielen und Aufgaben und die Verwaltung von Ressourcen, um die Projektlieferung rechtzeitig und innerhalb des Budgets sicherzustellen. Sie besitzt starke Führungsqualitäten und Fähigkeiten zur Problemlösung, was sie zu einem wichtigen Partner für den Projekterfolg macht und sie zu den gewünschten Ergebnissen führt.
he: מנהלת פרויקטים מקצועית עם ניסיון רב בתכנון ובביצוע בהצלחה של פרויקטים. היא אחראית לתיאום בין צוותים שונים, קביעת יעדים ומשימות וניהול משאבים כדי להבטיח משלוח פרויקטים בזמן ובתקציב. יש לה כישורי מנהיגות חזקים ויכולות לפתרון בעיות, מה שהופך אותה לשותפה מרכזית בהשגת הצלחת הפרויקט והנחייתם לעבר התוצאות הרצויות.

source: What is SOFTmsg?
de: Was ist SOFTmsg?

source: SOFTmsg is a marketplace for ready-to-use web projects. You can install and run applications instantly with one click, without needing programming skills.
de: SOFTmsg ist ein Marktplatz für sofort einsatzbereite Webprojekte. Sie können Anwendungen mit nur einem Klick installieren und ausführen, ganz ohne Programmierkenntnisse.

source: Do I need programming skills to use SOFTmsg?
de: Brauche ich Programmierkenntnisse, um SOFTmsg zu nutzen?

source: No. The platform is designed to be simple and user-friendly. Just choose a project, click install, and it will be deployed automatically on your server.
de: Nein. Die Plattform ist einfach und benutzerfreundlich gestaltet. Wählen Sie ein Projekt aus, klicken Sie auf Installieren, und es wird automatisch auf Ihrem Server bereitgestellt.

source: What payment options are available?
de: Welche Zahlungsmöglichkeiten stehen zur Verfügung?

source: SOFTmsg offers both free and paid plans. Paid plans can be purchased using credit cards, PayPal, and in some regions local payment methods.
de: SOFTmsg bietet sowohl kostenlose als auch kostenpflichtige Pläne an. Kostenpflichtige Pläne können mit Kreditkarten, PayPal oder in einigen Regionen mit lokalen Zahlungsmethoden erworben werden.

source: Can I customize the projects?
de: Kann ich die Projekte anpassen?

source: Yes. You can adjust settings directly from the dashboard, and if the project is open-source you can also download and modify the source code.
de: Ja. Sie können die Einstellungen direkt im Dashboard anpassen, und wenn das Projekt Open-Source ist, können Sie auch den Quellcode herunterladen und ändern.

source: Is there a free trial?
de: Gibt es eine kostenlose Testversion?

source: Yes. Many projects include a free plan or trial version so you can test them before upgrading to a paid subscription.
de: Ja. Viele Projekte bieten einen kostenlosen Plan oder eine Testversion, sodass Sie sie ausprobieren können, bevor Sie auf ein kostenpflichtiges Abonnement umsteigen.

source: How can I get support?
de: Wie kann ich Support erhalten?

source: You can reach support through live chat and email. We also provide a knowledge base with guides, tutorials, and troubleshooting steps.
de: Sie können den Support über Live-Chat und E-Mail erreichen. Außerdem stellen wir eine Wissensdatenbank mit Anleitungen, Tutorials und Problemlösungsanweisungen bereit.

source: Do you want to develop a custom program that <span class='text-primary'>meets your specific needs?
de: Möchten Sie ein benutzerdefiniertes Programm entwickeln, das <span class = 'text-primary'> Ihre spezifischen Anforderungen erfüllt?
he: האם ברצונך לפתח תוכנית מותאמת אישית ש- <span class = 'טקסט-פרימי'> עונה על הצרכים הספציפיים שלך?

source: Contact Form
de: Kontaktformular
he: טופס יצירת קשר

source: Contact us
de: Kontaktieren Sie uns
he: צרו קשר

source: Fill out the contact form now, and our dedicated team is ready to provide you with the support you need and turn your dreams into reality. Take the first step towards success!
de: Füllen Sie jetzt das Kontaktformular aus, und unser engagiertes Team ist bereit, Ihnen die Unterstützung zu bieten, die Sie benötigen, und verwandeln Sie Ihre Träume in die Realität. Machen Sie den ersten Schritt zum Erfolg!
he: מלא את טופס יצירת הקשר עכשיו, והצוות המסור שלנו מוכן לספק לך את התמיכה הדרושה לך ולהפוך את חלומותיך למציאות. קח את הצעד הראשון לקראת הצלחה!

source: Email address
de: E-Mail-Adresse
he: כתובת דוא"ל

source: Phone Number
de: Telefonnummer
he: מספר טלפון

source: Project Description
de: Projektbeschreibung
he: תיאור הפרויקט

source: Enter a detailed description of your project.
de: Geben Sie eine detaillierte Beschreibung Ihres Projekts ein.
he: הזן תיאור מפורט של הפרויקט שלך.

source: Examples of similar websites
de: Beispiele für ähnliche Websites
he: דוגמאות לאתרים דומים

source: Provide examples or links to designs and websites you like.
de: Geben Sie Beispiele oder Links zu Designs und Websites an, die Sie mögen.
he: ספק דוגמאות או קישורים לעיצובים ואתרים שאתה אוהב.

source: By sending this form I confirm that I have read and accept the Privacy Policy
de: Durch das Senden dieses Formulars bestätige ich, dass ich die Datenschutzrichtlinie gelesen und akzeptiert habe
he: על ידי שליחת טופס זה אני מאשר שקראתי וקיבלתי את מדיניות הפרטיות

source: You must agree before submitting.
de: Sie müssen sich vor dem Einreichen zustimmen.
he: עליך להסכים לפני הגשת.

source: Submit
de: Einreichen
he: לְהַגִישׁ

source: No programming needed – we handle setup and hosting
de: Keine Programmierkenntnisse erforderlich – wir kümmern uns um Installation und Hosting

source: Manage all your deployed projects in one place
de: Verwalten Sie alle Ihre bereitgestellten Projekte an einem Ort

source: A marketplace of open-source projects, ready to launch
de: Ein Marktplatz für Open-Source-Projekte, sofort startbereit

source: Your marketplace for ready-to-use web projects
de: Ihr Marktplatz für sofort nutzbare Webprojekte

source: Deploy projects with just one click in one dashboard
de: Projekte mit nur einem Klick über ein Dashboard bereitstellen

source: No programming needed – we set it up for you
de: Keine Programmierung nötig – wir richten alles für Sie ein

source: Manage all your apps, domains, and hosting in one dashboard
de: Verwalten Sie alle Ihre Apps, Domains und Ihr Hosting in einem Dashboard

source: Open-source projects, install and run instantly
de: Open-Source-Projekte, sofort installieren und ausführen

source: One-Click Deploy
de: Bereitstellung mit einem Klick

source: Ready-to-Use Code
de: Fertig nutzbarer Code

source: Easy Configuration
de: Einfache Konfiguration

source: Secure Setup
de: Sichere Einrichtung

source: Server Ready
de: Serverbereit

source: Import/Export Projects
de: Projekte importieren/exportieren

source: Collaborate Easily
de: Einfache Zusammenarbeit

source: Responsive Design
de: Responsives Design

source: Guaranteed Updates
de: Garantierte Updates

source: Save time and effort with an integrated platform to manage employees, salaries, attendance, evaluations, and much more in one place – for smooth and efficient management.
de: Sparen Sie Zeit und Aufwand mit einer integrierten Plattform zur Verwaltung von Mitarbeitern, Gehältern, Anwesenheit, Bewertungen und vielem mehr an einem Ort – für ein reibungsloses und effizientes Management.

source: Smart Human Resources System <br><span class='text-primary'>Organize your company and achieve maximum productivity</span>
de: Smart Human Resources System <br> <span class = 'text-primary'> organisieren Sie Ihr Unternehmen und erreichen maximale Produktivität </span>
he: מערכת משאבי אנוש חכמה <br> <span class = 'text-primary'> ארגן את החברה שלך והשיג פרודוקטיביות מקסימאלית </span>

source: HR Management System <span class='text-success'> <br> Solutions</span>
de: HR-Managementsystem <span class = 'text-success'> <br> Lösungen </span>
he: מערכת ניהול HR <span class = 'text-success'> <br> פתרונות </span>

source: Analytics
de: Analyse
he: ניתוח

source: Manage Recruitment
de: Rekrutierung verwalten
he: ניהול גיוס

source: Manage Employees
de: Mitarbeiter verwalten
he: לנהל עובדים

source: Manage Attendance
de: Anwesenheit verwalten
he: נהל נוכחות

source: Manage Leave
de: Urlaub verwalten
he: נהל חופשה

source: Manage Onboarding
de: Onboarding verwalten
he: נהל על הספינה

source: Manage Assets
de: Vermögen verwalten
he: לנהל נכסים

source: Manage Payroll
de: Layroll verwalten
he: נהל שכר

source: Manage Offboarding
de: Offboarding verwalten
he: נהל את הסיבוב

source: Manage Help Desk
de: Helpdesk verwalten
he: נהל את דלפק העזרה

source: Contract Management
de: Vertragsmanagement
he: ניהול חוזים

source: Training & Development
de: Schulung & Entwicklung

source: Rewards & Incentives
de: Belohnungen & Anreize

source: Disciplinary Actions
de: Disziplinarmaßnahmen

source: Overtime Management
de: Überstundenmanagement
he: ניהול שעות נוספות

source: Meetings & Appointments
de: Sitzungen und Termine
he: פגישות ומינויים

source: Feedback & Complaints System
de: Feedback- & Beschwerdesystem

source: Ticketing System
de: Ticket-System

source: Digital Document Management
de: Digital Dokumentverwaltung
he: ניהול מסמכים דיגיטלי

source: Reports
de: Berichte
he: דוחות

source: Exporting
de: Exportieren
he: ייצוא

source: Notifications
de: Benachrichtigungen
he: התראות

source: Multi Languages
de: Multisprachen
he: רב שפות

source: System Customizing
de: Systemanpassung
he: התאמה אישית של מערכת

source: Protection
de: Schutz
he: הֲגָנָה

source: Updates
de: Aktualisierungen
he: עדכונים

source: Technical Support
de: Technische Unterstützung
he: תמיכה טכנית

source: System Features
de: Systemfunktionen
he: תכונות מערכת

source: Quick Guide to the HR Management System
de: Schnellhandbuch zum HR-Management-System
he: מדריך מהיר למערכת ניהול משאבי אנוש

source: Get Started
de: Fangen an
he: התחל

source: Employee Performance
de: Leistung der Mitarbeiter
he: ביצועי עובדים

source: Employee Engagement
de: Engagement der Mitarbeiter
he: מעורבות עובדים

source: Workplace social engagement
de: Soziales Engagement am Arbeitsplatz
he: מעורבות חברתית במקום העבודה

source: System Images
de: Systembilder
he: תמונות מערכת

source: Home Page
de: Startseite
he: דף הבית
