Repository: AhmedSheri123/softmsg-deployer
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, he

source: your name...
de: Ihr Name...
he: שמך ...

source: your last name...
de: Dein Nachname ...
he: שם המשפחה שלך ...

source: phone number
de: Telefonnummer
he: מספר טלפון

source: your company name...
de: Ihr Firmenname ...
he: שם החברה שלך ...

source: Password
de: Passwort
he: סִיסמָה

source: Pending
de: Ausstehend

source: Paid
de: Bezahlt

source: Completed
de: Abgeschlossen

source: Cancelled
de: Abgebrochen

source: Buy
de: Kaufen

source: Renew
de: Plan erneuern

source: Upgrade
de: Plan upgraden

source: Order ID
de: Bestell-ID
he: מזהה הזמנה

source: Order Secret Code
de: Geheimer Bestellcode
he: להזמין קוד סודי

source: Transaction Number
de: Transaktionsnummer
he: מספר עסקה

source: Order Progress
de: Bestellstatus
he: הזמנת התקדמות

source: Order Type
de: Bestelltyp

source: Creation Date
de: Erstellungsdatum
he: תאריך יצירה

source: Service Payment Order
de: Service-Zahlungsauftrag

source: Service Payment Orders
de: Service-Zahlungsaufträge

source: Patient Management
de: Patientenmanagement
he: ניהול מטופלים

source: School Management
de: Schulmanagement
he: ניהול בית ספר

source: HR Management
de: Personalmanagement
he: ניהול HR

source: Monthly
de: Monatlich
he: יַרחוֹן

source: Yearly
de: Jährlich
he: שְׁנָתִי

source: Complited
de: Angepasst
he: הושלם

source: Create Project
de: Projekt erstellen
he: צור פרויקט

source: Choose Plan
de: Wählen Sie Plan
he: בחר תוכנית

source: Project Settings
de: Projekteinstellungen
he: הגדרות פרויקט

source: Building
de: Wird erstellt

source: Failed
de: Fehlgeschlagen

source: Service Title
de: Servicetitel
he: כותרת שירות

source: Subtitle
de: Untertitel
he: כְּתוּבִית

source: Service
de: Dienst
he: שֵׁרוּת

source: Service Model
de: Dienstmodell
he: מודל שירות

source: Service Models
de: Dienstmodelle
he: דגמי שירות

source: User
de: Benutzer
he: מִשׁתַמֵשׁ

source: Project Name
de: Projektname
he: שם הפרויקט

source: Progress
de: Fortschritt
he: הִתקַדְמוּת

source: Service Subscription ID
de: Dienstabonnement-ID
he: מזהה מנוי שירות

source: Service User ID
de: Dienstbenutzer-ID
he: מזהה משתמש שירות

source: Service Subscription Date
de: Abonnementdatum
he: תאריך מנוי שירות

source: Plan Scope
de: Planumfang
he: תכנון היקף

source: System Progress
de: Systemfortschritt

source: User Service Model
de: Benutzerdienstmodell
he: מודל שירות משתמש

source: User Service Models
de: Benutzerdienstmodelle
he: דגמי שירות משתמשים

source: Project deployed successfully!
de: Projekt erfolgreich bereitgestellt!

source: No container found for this deployment.
de: Für diese Bereitstellung wurde kein Container gefunden.

source: Domain cannot be empty.
de: Die Domain darf nicht leer sein.

source: Project domain updated to {new_domain}.
de: Die Projektdomain wurde auf {new_domain} aktualisiert.

source: Cannot create database backup: no valid DB config found for this project.
de: Datenbanksicherung konnte nicht erstellt werden: Keine gültige DB-Konfiguration für dieses Projekt gefunden.

source: Backup ({backup_type}) created successfully.
de: Backup ({backup_type}) erfolgreich erstellt.

source: Failed to create backup: {e}
de: Fehler beim Erstellen des Backups: {e}

source: Backup restored successfully.
de: Backup erfolgreich wiederhergestellt.

source: Failed to restore backup: {e}
de: Fehler beim Wiederherstellen des Backups: {e}

source: Backup deleted successfully.
de: Backup erfolgreich gelöscht.

source: Failed to delete backup: {e}
de: Fehler beim Löschen des Backups: {e}

source: No file selected.
de: Keine Datei ausgewählt.

source: Backup uploaded successfully.
de: Backup erfolgreich hochgeladen.

source: write your name...
de: Geben Sie Ihren Namen ein...
he: כתוב את שמך ...

source: e.g., +1 234 567 890
de: z.B., +1 234 567 890
he: למשל, +1 234 567 890

source: How can our team help you?
de: Wie kann unser Team Ihnen helfen?
he: איך הצוות שלנו יכול לעזור לך?

source: Full Name
de: Vollständiger Name
he: שם מלא

source: Your has been subscribed successfully.
de: Ihr Abonnement war erfolgreich.
he: שלך נרשם בהצלחה.

source: Please confirm the reCAPTCHA.
de: Bitte bestätigen Sie das reCAPTCHA.

source: Your message has been sent successfully. You will be replied after reviewing the details.
de: Ihre Nachricht wurde erfolgreich gesendet. Sie erhalten nach Überprüfung der Details eine Antwort.
he: ההודעה שלך נשלחה בהצלחה. תשיב לך לאחר סקירת הפרטים.

source: The service has been successfully purchased. Please wait {install_time_minutes} minutes for the installation to complete.
de: Der Service wurde erfolgreich gekauft. Bitte warten Sie {install_time_minutes} Minuten, bis die Installation abgeschlossen ist.

source: Failed to start the app
de: Die App konnte nicht gestartet werden.

source: An error occurred while activating the service. Please try again later.
de: Beim Aktivieren des Services ist ein Fehler aufgetreten. Bitte versuchen Sie es später erneut.

source: The plan has been successfully renewed.
de: Der Plan wurde erfolgreich erneuert.

source: Technologies
de: Technologien

source: Select technologies...
de: Technologien auswählen...

source: Categories
de: Kategorien

source: Select categories...
de: Kategorien auswählen...

source: Category
de: Kategorie

source: Beginner
de: Anfänger

source: Intermediate
de: Fortgeschritten

source: Advanced
de: Experte

source: Description
de: Beschreibung

source: Image
de: Bild

source: Difficulty Level
de: Schwierigkeitsgrad

source: Estimated Install Time (minutes)
de: Geschätzte Installationszeit (Minuten)

source: Required Disk Size (MB)
de: Erforderlicher Speicherplatz (MB)

source: Minimum Operating Requirements
de: Minimale Systemanforderungen

source: Installation Steps
de: Installationsschritte

source: Number of Installs
de: Anzahl der Installationen

source: About Project
de: Über das Projekt

source: Publication Date
de: Veröffentlichungsdatum

source: Label
de: Bezeichnung

source: Command
de: Befehl

source: The function name or command to execute via Docker
de: Der Funktionsname oder Befehl, der über Docker ausgeführt wird

source: String
de: Zeichenkette

source: Boolean
de: Boolesch

source: Integer
de: Ganzzahl

source: Internal Name
de: Interner Name

source: Internal name for code usage
de: Interner Name für die Verwendung im Code

source: Data Type
de: Datentyp

source: Required
de: Erforderlich

source: Default Value
de: Standardwert

source: Title
de: Titel

source: Key
de: Schlüssel

source: Is Secret
de: Ist geheim

source: Sort Index
de: Sortierindex

source: Log in
de: Einloggen
he: התחבר

source: Email Address
de: E-Mail-Adresse
he: כתובת דוא"ל

source: Dont have account? Create Account
de: Noch kein Konto? Konto erstellen

source: Edit profile
de: Profil bearbeiten
he: ערוך פרופיל

source: Upload profile image
de: Profilbild hochladen
he: העלה תמונת פרופיל

source: First name
de: Vorname
he: שֵׁם פְּרַטִי

source: Looks good!
de: Sieht gut aus!
he: נראה טוב!

source: Please fill your first name.
de: Bitte füllen Sie Ihren Vornamen aus.
he: אנא מלא את שמך הפרטי.

source: Last name
de: Nachname
he: שֵׁם מִשׁפָּחָה

source: Please fill your last name.
de: Bitte füllen Sie Ihren Nachnamen.
he: אנא מלא את שם המשפחה שלך.

source: Please fill your email.
de: Bitte füllen Sie Ihre E -Mail aus.
he: אנא מלא את הדוא"ל שלך.

source: Phone number
de: Telefonnummer
he: מספר טלפון

source: Please fill your phone number.
de: Bitte füllen Sie Ihre Telefonnummer.
he: אנא מלא את מספר הטלפון שלך.

source: Company name
de: Name der Firma
he: שם החברה

source: Please fill your company name.
de: Bitte füllen Sie Ihren Firmennamen.
he: אנא מלא את שם החברה שלך.

source: Save
de: Speichern
he: לְהַצִיל

source: Preview
de: Vorschau
he: תצוגה מקדימה

source: Change
de: Ändern
he: לְשַׁנוֹת

source: Close
de: Schließen
he: לִסְגוֹר

source: Create an account
de: Ein Konto erstellen
he: צור חשבון

source: First Name
de: Vorname
he: שֵׁם פְּרַטִי

source: Last Name
de: Nachname
he: שֵׁם מִשׁפָּחָה

source: Phone
de: Telefon
he: טֵלֵפוֹן

source: Company Name
de: Name der Firma
he: שם החברה

source: Create
de: Erstellen
he: לִיצוֹר

source: Buy Service
de: Dienst kaufen

source: Backups for Deployment
de: Backups für die Bereitstellung

source: Upload Backup
de: Backup hochladen

source: Full Backup
de: Vollständiges Backup

source: Database Only
de: Nur Datenbank

source: Files Only
de: Nur Dateien

source: Create Backup
de: Backup erstellen

source: Type
de: Typ

source: Size (MB)
de: Größe (MB)

source: Created At
de: Erstellt am

source: Restored
de: Wiederhergestellt

source: Options
de: Optionen
he: אפשרויות

source: Running
de: Läuft

source: Yes
de: Ja

source: No
de: Nein

source: Restore
de: Wiederherstellen

source: Download
de: Herunterladen

source: Delete
de: Löschen
he: לִמְחוֹק

source: Delete this backup?
de: Dieses Backup löschen?

source: After deleting, the backup file cannot be restored or downloaded again.
de: Nach dem Löschen kann die Backup-Datei nicht wiederhergestellt oder erneut heruntergeladen werden.

source: Yes, Delete
de: Ja, löschen

source: Cancel
de: Abbrechen

source: No backups found.
de: Keine Backups gefunden.

source: Upload a backup file
de: Backup-Datei hochladen

source: Select a backup file to add it to this deployment.
de: Wählen Sie eine Backup-Datei aus, um sie zu dieser Bereitstellung hinzuzufügen.

source: Change Domain
de: Domain ändern

source: Reinstall
de: Neu installieren

source: Resource Allocation
de: Ressourcenzuweisung

source: used
de: benutzt

source: Hard Restart
de: Erzwungener Neustart

source: Restart
de: Neustarten

source: Stop
de: Stoppen

source: Logs
de: Protokolle

source: Deployment Info
de: Bereitstellungsinformationen

source: Domain
de: Domäne

source: Subscription Info
de: Abonnementinformationen
he: מידע על מנוי

source: Plan scope
de: Planungsumfang
he: תכנון היקף

source: Subscription status
de: Abonnementstatus
he: סטטוס מנוי

source: Subscription date
de: Abonnementdatum
he: תאריך מנוי

source: Subscription end date
de: Abonnement Enddatum
he: תאריך סיום המנוי

source: Actions
de: Aktionen
he: פעולות

source: Renew plan
de: Plan verlängern
he: חידוש תוכנית

source: Change Project Domain
de: Projekt-Domain ändern

source: New Domain
de: Neue Domain

source: Update Domain
de: Domain aktualisieren

source: Rset Domain
de: Domain zurücksetzen

source: By clicking Update, the project domain will be changed.
de: Durch Klicken auf 'Aktualisieren' wird die Projekt-Domain geändert.

source: Delete this service?
de: Diesen Dienst löschen?
he: למחוק את השירות הזה?

source: after deleting this service you can't restore again.
de: Nachdem Sie diesen Service gelöscht haben, können Sie nicht wieder wiederherstellen.
he: לאחר מחיקת השירות הזה אינך יכול לשחזר שוב.

source: Yes, delete
de: Ja, löschen
he: כן, מחק

source: No thanks
de: Nein danke
he: לא תודה

source: Reinstalling this app?
de: Diese App neu installieren?

source: After reinstalling, the application data cannot be restored again.
de: Nach der Neuinstallation können die Anwendungsdaten nicht wiederhergestellt werden.

source: Yes, Reinstall
de: Ja, neu installieren

source: Save All
de: Alles speichern

source: Environment variables updated successfully!
de: Umgebungsvariablen erfolgreich aktualisiert!

source: My Services
de: Meine Dienste

source: Project
de: Projekt
he: פּרוֹיֶקט

source: View Deployment Details
de: Bereitstellungsdetails ansehen

source: View
de: Ansehen
he: נוֹף

source: Restart Device
de: Gerät neu starten

source: Rebuild
de: Neu aufbauen

source: Delete this Deployment
de: Diese Bereitstellung löschen?

source: No services found.
de: Keine Dienste gefunden.

source: After deleting this service you can't restore it again.
de: Nachdem Sie diesen Dienst gelöscht haben, kann er nicht wiederhergestellt werden.

source: Active Service
de: Aktiver Service
he: שירות פעיל

source: Services
de: Dienstleistungen
he: שירותים

source: last update
de: Letztes Update
he: עדכון אחרון

source: just now
de: soeben
he: זֶה עַתָה

source: Copmlited Orders
de: Copmlited Bestellungen
he: הזמנות COPMLIDED

source: Orders
de: Bestellungen
he: הזמנות

source: Uncopmlited Orders
de: Uncopmlited Bestellungen
he: הזמנות לא מאושרות

source: Last Orders
de: Letzte Bestellungen
he: הזמנות אחרונות

source: Project name
de: Projektname
he: שם הפרויקט

source: Scope
de: Umfang
he: תְחוּם

source: Continue
de: Weitermachen
he: לְהַמשִׁיך

source: Use
de: Verwenden
he: לְהִשְׁתַמֵשׁ

source: My Order List
de: Meine Bestellliste
he: רשימת ההזמנות שלי

source: Choose the plan that suits you
de: Wählen Sie den Plan, der zu Ihnen passt

source: Free
de: Kostenlos

source: Month
de: Monatlich

source: Year
de: Jährlich

source: Subscribe Now
de: Jetzt abonnieren

source: Plans Comparison
de: Planvergleich

source: Feature
de: Funktion

source: Storage
de: Speicher

source: Database
de: Datenbank

source: Frequently Asked Questions
de: Häufig gestellte Fragen

source: Can I upgrade my plan later?
de: Kann ich meinen Plan später upgraden?

source: Yes, you can upgrade your plan anytime from the dashboard.
de: Ja, Sie können Ihren Plan jederzeit über das Dashboard upgraden.

source: Is there a refund policy?
de: Gibt es eine Rückerstattungsrichtlinie?

source: Yes, we have a 14-day money-back guarantee.
de: Ja, wir bieten eine 14-tägige Geld-zurück-Garantie.

source: Can I cancel my subscription anytime?
de: Kann ich mein Abonnement jederzeit kündigen?

source: Yes, you can cancel anytime. Your account will remain active until the end of the paid period.
de: Ja, Sie können jederzeit kündigen. Ihr Konto bleibt bis zum Ende des bezahlten Zeitraums aktiv.

source: Are taxes included in the prices?
de: Sind Steuern in den Preisen enthalten?

source: Prices do not include taxes. VAT may be applied depending on your country.
de: Preise verstehen sich ohne Steuern. Die Mehrwertsteuer kann je nach Land anfallen.

source: Do you offer 24/7 support?
de: Bieten Sie 24/7 Support an?

source: Yes, our support team is available 24/7 via live chat and email.
de: Ja, unser Support-Team ist rund um die Uhr über Live-Chat und E-Mail erreichbar.

source: Can I try the service before paying?
de: Kann ich den Service vor der Zahlung testen?

source: Yes, we provide a free trial for some plans so you can test the service before subscribing.
de: Ja, für einige Pläne bieten wir eine kostenlose Testphase an, damit Sie den Service vor dem Abonnement testen können.

source: What payment methods are available?
de: Welche Zahlungsmethoden stehen zur Verfügung?

source: We accept credit cards, PayPal, and bank transfers.
de: Wir akzeptieren Kreditkarten, PayPal und Banküberweisungen.

source: Can I downgrade to a cheaper plan?
de: Kann ich auf einen günstigeren Plan wechseln?

source: Yes, you can downgrade anytime and your invoice will be adjusted accordingly.
de: Ja, Sie können jederzeit downgraden, und Ihre Rechnung wird entsprechend angepasst.

source: Customer Testimonials
de: Kundenbewertungen

source: Entrepreneur
de: Unternehmer

source: Great service, easy to use!
de: Toller Service, einfach zu bedienen!

source: Best hosting I’ve tried so far.
de: Das beste Hosting, das ich bisher ausprobiert habe.

source: Web Developer
de: Webentwickler

source: Excellent and responsive support.
de: Ausgezeichneter und schneller Support

source: Subscribe today and get 20%% off the yearly plan
de: Abonnieren Sie noch heute und erhalten Sie 20%% Rabatt auf den Jahresplan

source: No image available
de: Kein Bild verfügbar

source: Documentation
de: Dokumentation

source: Source Code
de: Quellcode

source: Difficulty Level:
de: Schwierigkeitsgrad:

source: Estimated Install Time:
de: Geschätzte Installationszeit:

source: minutes
de: Minuten

source: Required Disk Space:
de: Benötigter Speicherplatz:

source: Installations:
de: Installationen:

source: Install
de: Installieren

source: install project cloud
de: Projekt in der Cloud installieren

source: Click to install this project automatically
de: Klicken Sie, um dieses Projekt automatisch zu installieren

source: We will install the project for you, no need for a programmer.
de: Wir installieren das Projekt für Sie, kein Programmierer nötig.

source: Download and view the source code
de: Quellcode herunterladen und ansehen

source: Download Source Code
de: Quellcode herunterladen

source: Languages & Technologies Used:
de: Verwendete Sprachen & Technologien:

source: No specific technologies
de: Keine spezifischen Technologien

source: Minimum Operating Requirements:
de: Mindestanforderungen:

source: Optional Features After Install:
de: Optionale Funktionen nach der Installation:

source: Short Install Steps:
de: Kurze Installationsschritte:

source: No steps added yet
de: Noch keine Schritte hinzugefügt

source: Available Plans:
de: Verfügbare Pläne:

source: Your Comment
de: Ihr Kommentar

source: Add your comment here
de: Fügen Sie hier Ihren Kommentar hinzu

source: Access popular ready projects, control panels, and apps. Get up and running in minutes with smooth one-click installation.
de: Greifen Sie auf beliebte fertige Projekte, Control Panels und Apps zu. Starten Sie in wenigen Minuten mit einer reibungslosen Ein-Klick-Installation.

source: Any difficulty
de: Beliebiger Schwierigkeitsgrad

source: Sort by
de: Sortieren nach

source: Most Installed
de: Am häufigsten installiert

source: Highest Rated
de: Höchste Bewertung

source: Search
de: Suchen

source: Recommended
de: Empfohlen

source: No Image
de: Kein Bild

source: Most Popular
de: Am beliebtesten

source: New
de: Neu

source: Fast Install
de: Schnelle Installation

source: Average Rating
de: Durchschnittliche Bewertung

source: Loading details...
de: Details werden geladen...

source: Add Service
de: Service hinzufügen
he: הוסף שירות

source: Please fill a project name.
de: Bitte füllen Sie einen Projektnamen.
he: אנא מלא שם פרויקט.

source: Please select a service.
de: Bitte wählen Sie einen Service.
he: אנא בחר שירות.

source: Service Description
de: Servicebeschreibung
he: תיאור השירות

source: Done
de: Erledigt
he: נַעֲשָׂה

source: Next
de: Nächste
he: הַבָּא

source: School Settings
de: Schuleinstellungen
he: הגדרות בית ספר

source: Please fill a first name.
de: Bitte füllen Sie einen Vornamen.
he: אנא מלא שם פרטי.

source: Please fill a last name.
de: Bitte füllen Sie einen Nachnamen.
he: אנא מלא שם משפחה.

source: Please fill a username.
de: Bitte füllen Sie einen Benutzernamen.
he: אנא מלא שם משתמש.

source: Please fill a Email.
de: Bitte füllen Sie eine E -Mail aus.
he: אנא מלא דוא"ל.

source: Please fill a password.
de: Bitte füllen Sie ein Passwort.
he: אנא מלא סיסמה.

source: Please fill a phone number.
de: Bitte füllen Sie eine Telefonnummer.
he: אנא מלא מספר טלפון.

source: Hospital Settings
de: Krankenhauseinstellungen
he: הגדרות בית חולים

source: Hospital name
de: Krankenhausname
he: שם בית חולים

source: Please fill a hospital name.
de: Bitte füllen Sie einen Krankenhausnamen.
he: אנא מלא שם בית חולים.

source: Hospital address
de: Krankenhausadresse
he: כתובת בית חולים

source: Please fill a hospital address.
de: Bitte füllen Sie eine Krankenhausadresse.
he: אנא מלא כתובת בית חולים.

source: Language
de: Sprache
he: שָׂפָה

source: Please select a language.
de: Bitte wählen Sie eine Sprache.
he: אנא בחר שפה.

source: School name
de: Schulname
he: שם בית הספר

source: Please fill a School name.
de: Bitte füllen Sie einen Schulnamen.
he: אנא מלא שם בית ספר.

source: School address
de: Schuladresse
he: כתובת בית ספר

source: Please fill a School address.
de: Bitte füllen Sie eine Schuladresse.
he: אנא מלא כתובת בית ספר.

source: Academic Year
de: Akademisches Jahr
he: השנה האקדמית

source: Please fill a Academic Year.
de: Bitte füllen Sie ein akademisches Jahr.
he: אנא מלא שנה אקדמית.

source: Country
de: Land
he: מְדִינָה

source: Please select a Country.
de: Bitte wählen Sie ein Land.
he: אנא בחר מדינה.

source: My Service
de: Mein Service
he: השירות שלי

source: Service Address
de: Serviceadresse
he: כתובת שירות

source: Service purchase price
de: Servicekaufpreis
he: מחיר רכישת שירות

source: Complete the payment process
de: Vervollständigen Sie den Zahlungsvorgang
he: השלם את תהליך התשלום

source: All payments are made securely.
de: Alle Zahlungen werden sicher geleistet.
he: כל התשלומים נעשים בצורה מאובטחת.

source: Reset Password
de: Passwort zurücksetzen
he: אפס סיסמה

source: Change Password
de: Kennwort ändern
he: שנה סיסמה

source: title
de: Titel
he: כּוֹתֶרֶת

source: Plan Info
de: Planen Sie Informationen
he: תכנון מידע

source: Reset Project Password
de: Projektkennwort zurücksetzen
he: אפס את סיסמת הפרויקט

source: New Password
de: Neues Passwort
he: סיסמה חדשה

source: repeat new password
de: Neues Passwort wiederholen
he: חזור על סיסמה חדשה

source: Reset
de: Zurücksetzen
he: אִתחוּל

source: By clicking Reset, you will change the project dashboard password.
de: Wenn Sie auf Reset klicken, ändern Sie das Projekt -Dashboard -Passwort.
he: על ידי לחיצה על איפוס, תשנה את סיסמת לוח המחוונים של הפרויקט.

source: Project analytics
de: Projektanalyse
he: פרויקטים ניתוחים

source: Total Managers
de: Gesamtmanager
he: סך המנהלים

source: Managers
de: Manager
he: מנהלים

source: Inactive Service
de: Inaktiver Service
he: שירות לא פעיל

source: Patients
de: Patienten
he: חולים

source: Total visits
de: Gesamtbesuche
he: סה"כ ביקורים

source: visits
de: Besuche
he: ביקורים

source: Local visits
de: Lokale Besuche
he: ביקורים מקומיים

source: Home visits
de: Hausbesuche
he: ביקורי בית

source: Medical reports
de: Medizinische Berichte
he: דוחות רפואיים

source: reports
de: Berichte
he: דוחות

source: Local money
de: Lokales Geld
he: כסף מקומי

source: Home money
de: Hausgeld
he: כסף בית

source: Project Info
de: Projektinfo
he: מידע על פרויקט

source: total Students
de: Gesamtschüler
he: סה"כ סטודנטים

source: Students
de: Studenten
he: סטודנטים

source: Total Teachers
de: Gesamtlehrer
he: סה"כ מורים

source: Teachers
de: Lehrer
he: מורים

source: Total Employees
de: Gesamtbeschäftigte
he: סה"כ עובדים

source: Employees
de: Mitarbeiter
he: עובדים

source: Total Librarys
de: Gesamtbibliotheken
he: סך הכל ספריות

source: Librarys
de: Bibliotheken
he: ספריות

source: Total Budget
de: Gesamtbudget
he: התקציב הכולל

source: Total Expense
de: Gesamtkosten
he: הוצאה מוחלטת

source: Total Salary
de: Gesamtgehalt
he: משכורת מוחלטת

source: Total Income
de: Gesamteinkommen
he: ההכנסה הכוללת

source: Dashboard
de: Armaturenbrett
he: לוּחַ מַחווָנִים

source: Administrative message
de: Verwaltungsnachricht
he: הודעה מנהלית

source: New alerts
de: Neue Warnungen
he: התראות חדשות

source: There are no notifications at the moment.
de: Im Moment gibt es keine Benachrichtigungen.
he: כרגע אין התראות.

source: Clear answers to the most frequently asked questions about our services to help you get information quickly and easily.
de: Klare Antworten auf die am häufigsten gestellten Fragen zu unseren Diensten, damit Sie schnell und einfach Informationen erhalten können.
he: תשובות ברורות לשאלות הנפוצות ביותר לגבי השירותים שלנו כדי לעזור לך לקבל מידע במהירות ובקלות.

source: A versatile software suite transforming businesses of all sizes by simplifying complex systems into efficient work environments.
de: Eine vielseitige Software -Suite, die Unternehmen aller Größen verwandelt, indem komplexe Systeme in effiziente Arbeitsumgebungen vereinfacht werden.
he: חבילת תוכנה רב -תכליתית המשנה עסקים בכל הגדלים על ידי פשטת מערכות מורכבות לסביבות עבודה יעילות.

source: Install ready-to-use projects with just one click
de: Bereit zur Nutzung: Projekte mit nur einem Klick installieren

source: SOFTmsg For
de: SOFTmsg für
