Repository: AhmedSheri123/softmsg-deployer
Catalog: locale/*/LC_MESSAGES/django.po
Languages: de, he

source: we offer you a Students Invoice section that allows you to manage invoices easily and professionally. You can issue customized invoices for each student, accurately track payment statuses, and obtain detailed reports on paid and unpaid invoices. With customizable design, you can add your institution's logo and enhance the visual identity of the invoices. Join us today and enjoy flexibility in managing your students' accounts.
de: Wir bieten Ihnen einen Abschnitt "Studenten" -Burechnung, mit dem Sie Rechnungen einfach und professionell verwalten können. Sie können maßgeschneiderte Rechnungen für jeden Schüler ausstellen, den Zahlungsstatus genau verfolgen und detaillierte Berichte über bezahlte und unbezahlte Rechnungen erhalten. Mit einem anpassbaren Design können Sie das Logo Ihrer Institution hinzufügen und die visuelle Identität der Rechnungen verbessern. Besuchen Sie uns noch heute und genießen Sie die Flexibilität bei der Verwaltung der Konten Ihrer Schüler.
he: אנו מציעים לך קטע חשבוניות סטודנטים המאפשר לך לנהל חשבוניות בקלות ובמקצועיות. אתה יכול להנפיק חשבוניות בהתאמה אישית עבור כל סטודנט, לעקוב במדויק בסטטוס תשלום ולקבל דוחות מפורטים על חשבוניות בתשלום ובלתי שולמו. בעזרת עיצוב הניתן להתאמה אישית, אתה יכול להוסיף את הלוגו של המוסד שלך ולשפר את הזהות החזותית של החשבוניות. הצטרפו אלינו עוד היום ותיהנו מגמישות בניהול חשבונות התלמידים שלכם.

source: Library
de: Bibliothek
he: סִפְרִיָה

source: our Library section offers you a comprehensive solution for efficiently and professionally managing library resources. You can easily add books, organize them, and track loans, ensuring a seamless experience for users. The system provides you with detailed reports to help you make informed decisions about inventory. With a flexible and user-friendly interface, you can access all the information you need with just a few clicks. Join us today and enjoy managing your library with the utmost professionalism.
de: Unser Abschnitt Bibliothek bietet Ihnen eine umfassende Lösung für die effiziente und professionelle Verwaltung von Bibliotheksressourcen. Sie können problemlos Bücher hinzufügen, sie organisieren und Kredite verfolgen, um ein nahtloses Erlebnis für Benutzer zu gewährleisten. Das System bietet Ihnen detaillierte Berichte, mit denen Sie fundierte Entscheidungen über das Inventar treffen können. Mit einer flexiblen und benutzerfreundlichen Oberfläche können Sie mit nur wenigen Klicks auf alle Informationen zugreifen, die Sie benötigen. Besuchen Sie uns noch heute und verwalten Sie Ihre Bibliothek mit äußerster Professionalität.
he: מדור הספרייה שלנו מציע לך פיתרון מקיף לניהול יעיל ומקצועי של משאבי הספרייה. אתה יכול להוסיף בקלות ספרים, לארגן אותם ולעקוב אחר הלוואות, להבטיח חוויה חלקה למשתמשים. המערכת מספקת לך דוחות מפורטים שיעזרו לך לקבל החלטות מושכלות לגבי מלאי. עם ממשק גמיש וידידותי למשתמש, אתה יכול לגשת לכל המידע הדרוש לך רק עם כמה לחיצות. הצטרפו אלינו עוד היום ותיהנו לנהל את הספרייה שלכם עם המקצועיות הגדולה ביותר.

source: Export Report
de: Exportbericht
he: דוח ייצוא

source: we offer you the ability to generate comprehensive reports with ease and professionalism. You can customize the format of the reports according to your needs, allowing you to present data in a way that highlights important information. With our flexible interface, you can choose different formats and details to include, making it easier for you to make informed decisions. Join us today and enjoy managing your data efficiently and professionally.
de: Wir bieten Ihnen die Möglichkeit, umfassende Berichte mit Leichtigkeit und Professionalität zu erstellen. Sie können das Format der Berichte entsprechend Ihren Anforderungen anpassen, sodass Sie Daten auf eine Weise präsentieren können, die wichtige Informationen hervorhebt. Mit unserer flexiblen Schnittstelle können Sie verschiedene Formate und Details auswählen, die es Ihnen erleichtern, fundierte Entscheidungen zu treffen. Besuchen Sie uns noch heute und verwalten Sie Ihre Daten effizient und professionell.
he: אנו מציעים לך את היכולת לייצר דוחות מקיפים בקלות ובמקצועיות. אתה יכול להתאים אישית את פורמט הדוחות בהתאם לצרכים שלך, ולאפשר לך להציג נתונים באופן שמדגיש מידע חשוב. בעזרת הממשק הגמיש שלנו, אתה יכול לבחור פורמטים ופרטים שונים לכלול, מה שמקל עליך לקבל החלטות מושכלות. הצטרפו אלינו עוד היום ונהנו לנהל את הנתונים שלכם ביעילות ובמקצועיות.

source: Join the future of school management with our advanced system and get the first 30 days of free and unique experience!
de: Treten Sie der Zukunft des Schulmanagements mit unserem fortschrittlichen System bei und erhalten Sie die ersten 30 Tage freier und einzigartiger Erfahrung!
he: הצטרפו לעתיד ניהול בתי הספר עם המערכת המתקדמת שלנו וקבלו את 30 הימים הראשונים של חוויה בחינם וייחודית!

source: Home
de: Heim
he: בַּיִת

source: My Projects
de: Meine Projekte
he: הפרויקטים שלי

source: Admin
de: Administrator
he: מנהל

source: New project...
de: Neues Projekt ...
he: פרויקט חדש ...

source: Profile
de: Profil
he: פּרוֹפִיל

source: Sign out
de: Abmelden
he: תגע

source: Privacy Policy
de: Datenschutzrichtlinie
he: מדיניות פרטיות

source: Build Custom System For You
de: Erstellen Sie ein benutzerdefiniertes System für Sie
he: בנה עבורך מערכת מותאמת אישית

source: Subscribe to our newsletter
de: Abonnieren Sie unseren Newsletter
he: הירשם לניוזלטר שלנו

source: Monthly digest of what's new and exciting from us.
de: Monatlich verdau von dem, was neu und aufregend von uns ist.
he: עיכול חודשי של מה חדש ומרגש מאיתנו.

source: Subscribe
de: Abonnieren
he: הירשם

source: Browse
de: Durchsuchen
he: לְדַפדֵף

source: Log out
de: Melden Sie sich aus
he: התנתק

source: Sign Up
de: Melden Sie sich an
he: הירשם

source: Name
he: שֵׁם

source: Email
he: אֶלֶקטרוֹנִי

source: for management systems
he: למערכות ניהול

source: Go To Dashboard
he: עבור אל לוח המחוונים

source: Documentations
he: תיעוד

source: Username
he: שם משתמש

source: Plan
he: לְתַכְנֵן

source: Status
he: סטָטוּס

source: Upgrade plan
he: תוכנית שדרוג

source: Option
he: אוֹפְּצִיָה

source: Project Manager
he: מנהל פרויקטים

source: Login Tools
he: כלי כניסה

source: Solutions that actually <span class='text-success'>solve <br> your problems</span>
he: פתרונות שלמעשה <span class = 'text-uccess'> לפתור <br> הבעיות שלך </span>

source: IT tickets
he: זה כרטיסים

source: Tasks
he: משימות

source: Sales pipeline
he: צינור מכירות

source: Contacts
he: אנשי קשר

source: Roadmap planning
he: תכנון מפת דרכים

source: Recruitment
he: גִיוּס

source: Resource management
he: ניהול משאבים

source: Reporting
he: דיווח

source: UI/UX Designer
he: מעצב UI/UX

source: Frontend Designer
he: מעצב חזית

source: Multi Manager
he: רב מנהל

source: Chat System
he: מערכת צ'אט
